SarveshPatil7/Work-on-TI-F28379D/workspace/LAB4/LAB4_main.c
    // BM: comment this so that the print frequency is completely controlled by the EPWM5
//	if ((CpuTimer2.InterruptCount % 10) == 0) {
//		UARTPrint = 1;
//	}
}


//This function sets DACA to the voltage between 0V and 3V passed to this function.
//If outside 0V to 3V the output is saturated at 0V to 3V
//Example code
//float myu = 2.25;
//setDACA(myu); // DACA will now output 2.25 Volts
void setDACA(float dacouta0) {
    int16_t DACOutInt = 0;
    DACOutInt = 4096.0 * dacouta0 / 3.0; // perform scaling of 0 – almost 3V to 0 - 4095
    if (DACOutInt > 4095) DACOutInt = 4095;
    if (DACOutInt < 0) DACOutInt = 0;
    DacaRegs.DACVALS.bit.DACVALS = DACOutInt;
}

void setDACB(float dacouta1) {
    int16_t DACOutInt = 0;
    DACOutInt = 4096.0 * dacouta1 / 3.0; // perform scaling of 0 – almost 3V to 0 - 4095
    if (DACOutInt > 4095) DACOutInt = 4095;
    if (DACOutInt < 0) DACOutInt = 0;
    DacbRegs.DACVALS.bit.DACVALS = DACOutInt;
}

// BM: For exercise 1 ADCD_ISR function
//adcd1 pie interrupt
//__interrupt void ADCD_ISR (void) {
//    adcd0result = AdcdResultRegs.ADCRESULT0;
//    adcd1result = AdcdResultRegs.ADCRESULT1;
//    // Here covert ADCIND0 to volts
//    volt_adcd0 = adcd0result * 3.0 / 4096.0;
//    // Here write voltages value to DACA
//    setDACA(volt_adcd0);
//    // Print ADCIND0’s voltage value to TeraTerm every 100ms
//    counter++;
//    if (counter >= 100) {
//        UARTPrint = 1;
//        counter = 0;
//    }
//    AdcdRegs.ADCINTFLGCLR.bit.ADCINT1 = 1; //clear interrupt flag
//    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
//}


//xk is the current ADC reading, xk_1 is the ADC reading one millisecond ago, xk_2 two milliseconds ago, etc
float xk = 0;
float xk_1 = 0;
float xk_2 = 0;
float xk_3 = 0;
float xk_4 = 0;
//yk is the filtered value
float yk = 0;
//b is the filter coefficients
//float b[5] = {0.2,0.2,0.2,0.2,0.2}; // 0.2 is 1/5th therefore a 5 point average

// BM: new b generated by matlab with cutoff frequency 50Hz
//float b[5] = {   3.3833240118424500e-02,
//    2.4012702387971543e-01,
//    4.5207947200372001e-01,
//    2.4012702387971543e-01,
//    3.3833240118424500e-02};

// BM: new b generated by matlab with 4th order FIR with cutoff frequency 75Hz
//float b[5] = {  3.1532325664697325e-02,
//                2.3887950588306769e-01,
//                4.5917633690446985e-01,
//                2.3887950588306769e-01,
//                3.1532325664697325e-02};

// BM: new b generated by matlab with 21th order FIR with cutoff frequency 75Hz
float b[XKS_SIZE] = { -2.3890045153263611e-03,
                -3.3150057635348224e-03,
                -4.6136191242627002e-03,
                -4.1659855521681268e-03,
                1.4477422497795286e-03,
                1.5489414225159667e-02,
                3.9247886844071371e-02,
                7.0723964095458614e-02,
                1.0453473887246176e-01,
                1.3325672639406205e-01,
                1.4978314227429904e-01,
                1.4978314227429904e-01,
                1.3325672639406205e-01,
                1.0453473887246176e-01,
                7.0723964095458614e-02,
                3.9247886844071371e-02,
                1.5489414225159667e-02,
                1.4477422497795286e-03,
                -4.1659855521681268e-03,
                -4.6136191242627002e-03,
                -3.3150057635348224e-03,
                -2.3890045153263611e-03};

// BM: xk array
float xks[XKS_SIZE] = {0};
// BM: for exercise 2 ADCD_ISR function
//adcd1 pie interrupt
__interrupt void ADCD_ISR (void) {
    adcd0result = AdcdResultRegs.ADCRESULT0;
    adcd1result = AdcdResultRegs.ADCRESULT1;
    // Here covert ADCIND0, ADCIND1 to volts
    xks[0] = adcd0result * 3.0 / 4096.0; // ADCIND0 voltage reading;
    yk = 0;
    // BM: loop solution for calculating yk, just adding all multiplied values
    for (uint16_t i = 0; i < XKS_SIZE; i++) {
        yk += b[i] * xks[i];
    }
//    yk = b[0]*xk + b[1]*xk_1 + b[2]*xk_2 + b[3]*xk_3 + b[4]*xk_4;

    //Save past states before exiting from the function so that next sample they are the older state

    /* BM: the for loop solution for the past states update,
           start from the last part of the array,
           to the first one, and check for 0 in case that it overflow */
    for (uint16_t i = XKS_SIZE - 1; i > 0; i--) {
        if (i == 0) {
            break;
        }
        xks[i] = xks[i - 1];
    }

//    xk_4 = xk_3;
//    xk_3 = xk_2;
//    xk_2 = xk_1;
//    xk_1 = xk;
    // Here write yk to DACA channel
    setDACA(adcd0result * 3.0 / 4096.0);
    // Print ADCIND0 and ADCIND1’s voltage value to TeraTerm every 100ms
    counter++;
    if (counter >= 100) {
        UARTPrint = 1;
        counter = 0;
    }
    AdcdRegs.ADCINTFLGCLR.bit.ADCINT1 = 1; //clear interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}



/***************** BM: the following parts are for ADCA ************************/
__interrupt void ADCA_ISR (void) {
    adca0result = AdcaResultRegs.ADCRESULT0;
    adca1result = AdcaResultRegs.ADCRESULT1;
    xks0[0] = adca0result * 3.0 / 4096.0;
    xks1[0] = adca1result * 3.0 / 4096.0;
    yk0 = 0;
    yk1 = 0;
    // BM: loop solution for calculating yk, just adding all multiplied values
    for (uint16_t i = 0; i < XKS_SIZE; i++) {
        yk0 += b[i] * xks0[i];
        yk1 += b[i] * xks1[i];
    }

    /* BM: the for loop solution for the past states update,
           start from the last part of the array,
           to the first one, and check for 0 in case that it overflow */
    for (uint16_t i = XKS_SIZE - 1; i > 0; i--) {
        if (i == 0) {
            break;
        }
        xks0[i] = xks0[i - 1];
        xks1[i] = xks1[i - 1];
    }
//    setDACA(yk0);
//    setDACB(yk1);
    counter++;
    if (counter >= 100) {
        UARTPrint = 1;
        counter = 0;
    }
    AdcaRegs.ADCINTFLGCLR.bit.ADCINT1 = 1; //clear interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}


/***************** BM: the following parts are for ADCB in ex4 ************************/
float b3[XKS_SIZE1] = {  -6.3046914864397922e-04,
                        -1.8185681242784432e-03,
                        -2.5619416124584822e-03,
                        -1.5874939943956356e-03,
                        2.3695126689747326e-03,
                        8.3324969783531780e-03,
                        1.1803612855040625e-02,
                        6.7592967793297151e-03,
                        -9.1745119977290398e-03,
                        -2.9730906886035850e-02,
                        -3.9816452266421651e-02,
                        -2.2301647638687881e-02,
                        3.1027965907247105e-02,
                        1.1114350049251465e-01,
                        1.9245540210070616e-01,
                        2.4373020388648489e-01,
                        2.4373020388648489e-01,
                        1.9245540210070616e-01,
                        1.1114350049251465e-01,
                        3.1027965907247105e-02,
                        -2.2301647638687881e-02,
                        -3.9816452266421651e-02,
                        -2.9730906886035850e-02,
                        -9.1745119977290398e-03,
                        6.7592967793297151e-03,
                        1.1803612855040625e-02,
                        8.3324969783531780e-03,
                        2.3695126689747326e-03,
                        -1.5874939943956356e-03,
                        -2.5619416124584822e-03,
                        -1.8185681242784432e-03,
                        -6.3046914864397922e-04};

