SarveshPatil7/Work-on-TI-F28379D/workspace/LAB4/LAB4_main.c
float b4[XKS_SIZE2] = { -4.1384865093955942e-18,
                        2.4158288163475484e-05,
                        -1.3320677588450310e-04,
                        -2.1438469575543533e-04,
                        1.1898399936030848e-04,
                        5.3082205069710680e-04,
                        2.1893290271722703e-04,
                        -7.4768481245699380e-04,
                        -9.5792023943993328e-04,
                        4.6168341621969679e-04,
                        1.8598657706234230e-03,
                        7.0670080707196015e-04,
                        -2.2492456754091747e-03,
                        -2.7055293027965603e-03,
                        1.2307634272343665e-03,
                        4.6993269406780981e-03,
                        1.6984303126684232e-03,
                        -5.1577427312871921e-03,
                        -5.9361687426490355e-03,
                        2.5904429699616822e-03,
                        9.5104864390879260e-03,
                        3.3122378905612003e-03,
                        -9.7118714382866452e-03,
                        -1.0812123641265282e-02,
                        4.5715859206989177e-03,
                        1.6287321385412081e-02,
                        5.5122975619431172e-03,
                        -1.5726675339333283e-02,
                        -1.7056081487002734e-02,
                        7.0329483752597077e-03,
                        2.4459678182842035e-02,
                        8.0882772704277336e-03,
                        -2.2565290379886044e-02,
                        -2.3949227569375457e-02,
                        9.6706866781569138e-03,
                        3.2957303117234021e-02,
                        1.0685317933349465e-02,
                        -2.9243552530078470e-02,
                        -3.0461077862757931e-02,
                        1.2077118105660343e-02,
                        4.0427773465971463e-02,
                        1.2879264031643200e-02,
                        -3.4645501075422983e-02,
                        -3.5481182001261206e-02,
                        1.3834430631479126e-02,
                        4.5553192553114567e-02,
                        1.4277570256188015e-02,
                        -3.7792491047513456e-02,
                        -3.8090059866479127e-02,
                        1.4617663668474229e-02,
                        4.7377897417654163e-02,
                        1.4617663668474229e-02,
                        -3.8090059866479127e-02,
                        -3.7792491047513456e-02,
                        1.4277570256188015e-02,
                        4.5553192553114567e-02,
                        1.3834430631479126e-02,
                        -3.5481182001261206e-02,
                        -3.4645501075422983e-02,
                        1.2879264031643200e-02,
                        4.0427773465971463e-02,
                        1.2077118105660343e-02,
                        -3.0461077862757931e-02,
                        -2.9243552530078470e-02,
                        1.0685317933349465e-02,
                        3.2957303117234021e-02,
                        9.6706866781569138e-03,
                        -2.3949227569375457e-02,
                        -2.2565290379886044e-02,
                        8.0882772704277336e-03,
                        2.4459678182842035e-02,
                        7.0329483752597077e-03,
                        -1.7056081487002734e-02,
                        -1.5726675339333283e-02,
                        5.5122975619431172e-03,
                        1.6287321385412081e-02,
                        4.5715859206989177e-03,
                        -1.0812123641265282e-02,
                        -9.7118714382866452e-03,
                        3.3122378905612003e-03,
                        9.5104864390879260e-03,
                        2.5904429699616822e-03,
                        -5.9361687426490355e-03,
                        -5.1577427312871921e-03,
                        1.6984303126684232e-03,
                        4.6993269406780981e-03,
                        1.2307634272343665e-03,
                        -2.7055293027965603e-03,
                        -2.2492456754091747e-03,
                        7.0670080707196015e-04,
                        1.8598657706234230e-03,
                        4.6168341621969679e-04,
                        -9.5792023943993328e-04,
                        -7.4768481245699380e-04,
                        2.1893290271722703e-04,
                        5.3082205069710680e-04,
                        1.1898399936030848e-04,
                        -2.1438469575543533e-04,
                        -1.3320677588450310e-04,
                        2.4158288163475484e-05,
                        -4.1384865093955942e-18};
float xks3[XKS_SIZE1] = {0};
float xks4[XKS_SIZE2] = {0};

__interrupt void ADCB_ISR (void) {
    GpioDataRegs.GPBCLEAR.bit.GPIO52 = 1;
    adcb0result = AdcbResultRegs.ADCRESULT0;
    adcb1result = AdcbResultRegs.ADCRESULT1;
    xks4[0] = adcb0result * 3.0 / 4096.0;
    yk3 = 0;
    // BM: loop solution for calculating yk, just adding all multiplied values
    for (uint16_t i = 0; i < XKS_SIZE2; i++) {
        yk3 += b4[i] * xks4[i];
    }


    /* BM: the for loop solution for the past states update,
           start from the last part of the array,
           to the first one, and check for 0 in case that it overflow */
    for (uint16_t i = XKS_SIZE2 - 1; i > 0; i--) {
        if (i == 0) {
            break;
        }
        xks4[i] = xks4[i - 1];
    }
    GpioDataRegs.GPBSET.bit.GPIO52 = 1;
//    yk3 = adcb0result * 3.0 / 4096.0;
    setDACA(yk3 + 1.5);
    counter++;
    if (counter >= 100) {
        UARTPrint = 1;
        counter = 0;
    }
    AdcbRegs.ADCINTFLGCLR.bit.ADCINT1 = 1; //clear interrupt flag
    PieCtrlRegs.PIEACK.all = PIEACK_GROUP1;
}
